{"meta":{"title":"Benderay's blog","subtitle":null,"description":"记录生活","author":"Benderay","url":"https://benderay.github.io"},"pages":[{"title":"archives","date":"2018-04-13T12:17:16.000Z","updated":"2018-04-13T12:17:52.422Z","comments":true,"path":"archives/index.html","permalink":"https://benderay.github.io/archives/index.html","excerpt":"","text":""},{"title":"tags","date":"2018-04-13T12:13:05.000Z","updated":"2018-04-13T12:15:19.385Z","comments":true,"path":"tags/index.html","permalink":"https://benderay.github.io/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2018-04-13T12:20:03.000Z","updated":"2018-04-13T12:20:27.885Z","comments":true,"path":"categories/index.html","permalink":"https://benderay.github.io/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"酒精计划","slug":"酒精计划","date":"2021-04-30T12:45:44.000Z","updated":"2021-04-30T13:01:20.796Z","comments":true,"path":"2021/04/30/酒精计划/","link":"","permalink":"https://benderay.github.io/2021/04/30/酒精计划/","excerpt":"","text":"“什么是青春？是梦。什么是爱情？是梦的内容。” 4个中年高中男老师，在经历了人到中年的沉闷与不顺之后，生活开始不如意。于是他们借研究酒精对人体影响的借口，在工作中逐渐增加自己体内的酒精浓度。直到剧中他们喝了个烂醉之后，他们当中有的人陷了进去，有的人开始正视自己的生活。直到最后，主角跳完一段舞蹈，带着复杂的情感张开身体从码头纵身一跃，画面记录在贴着地面的镜头中，影片到此结束，留下了一个开放结局。从我的感觉来说，这是一部平和真实的电影，看完之后整个人安静的感觉就像这里的故事也会发生在我身上一样。 片头和片尾有两个观点，在片头，“年轻人的爱情是梦境一般”（“美好”，但我想把“美好”省掉，因为我还很年轻，但我在括号里写这个是因为我觉得影片觉得“美好”）；在片末，“处理失败最重要的是要接受失败了这件事情，为了爱自己爱生活，要接受自己的错误”。也许影片在讲这样一件事情，中年人因为生活中一些小事的磕碰逐渐对生活没有希望、迷失之后，开始回忆、憧憬青春恋爱的感觉并想要借酒激励自己但事与愿违，最后在生活的碰撞中认识到生活的真实并继续生活的节奏。 但是我觉得如果只是在说中年人的事情对我有些枯燥了，我确实还年轻，但也不小了。那对一个青年来说，他有青年危机吗？那肯定是有的。我就是一个青年，我对未来没有明确的规划，目前来说甚至不知道怎么把研究工作继续下去，我不知道我以后会怎么样；我有个同学吃着火锅想起自己还没有男朋友会突然流泪，她觉得自己不会幸福了；我还有一个同学在焦虑自己如果有了孩子以后怎么教育都觉得不够完美。那么开场白如果把年龄换一下，是不是又合理起来了： “什么是童年？是梦。什么是快乐？是梦的内容。“ 所以，如果将中年危机简单的看作生活中的困境，是那种如灰犀牛一般我们眼睁睁看着它慢慢走来的那种困境，这种困境我们也许无法或者无法轻易解决。但梦与现实是割裂的，渴望一个契机让梦境回归现实，即渴望酒后的自己重回生活的轨道，倒不如承认现实中的变化。 那么，困境、问题被发现被正视，但是无法解决的时候，要怎么样才好？在片头，年轻人围着湖比赛边跑边喝，跑完全程甚至边喝边吐；在片中，几个中年人对身体酒精浓度的管理，直到喝到了燃点后危机开始爆发；在片尾，中年高中教师和毕业生相聚在码头畅饮。如果将片头的环湖赛跑看作人生的进程，片尾的畅饮就像人生赛跑中的一次畅饮，那么片中管理饮酒量的扭捏就不那么容易让人接受。但是无法避免的困境，又该如何面对，确实无法想明白。环湖赛跑有人没能够到终点，有人到了终点，但影片拍了年轻人终点冲线后的畅快，那我还是希望这个影片是一部积极向上的吧。但都写到这里了，我也自觉有些胡言乱语了。 我在看这部电影的时候让自己喝了点酒，在写这篇小作文的时候让自己喝了咖啡，我在哪个时间段是清醒的呢？","categories":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/categories/inadvertently/"}],"tags":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/tags/inadvertently/"}]},{"title":"Value Iteration Policy Iteration","slug":"Value Iteration Policy Iteration","date":"2021-03-23T13:11:40.000Z","updated":"2021-03-23T13:18:21.990Z","comments":true,"path":"2021/03/23/Value Iteration Policy Iteration/","link":"","permalink":"https://benderay.github.io/2021/03/23/Value Iteration Policy Iteration/","excerpt":"","text":"There are two main scheme in the iterative adaptive dynamic programming, which are value iteration and policy iteration. Especially in addressing the optimal control problems of nonlinear discrete-time systems, there are fundamental algorithms that promotes the practical implementation of the adaptive dynamic programming. So, here, this blog article try to sketch the outline of the iterative adaptive dynamic programming that utilized in the general nonlinear discrete-time system. Derive the optimal control lawConsidering the non-affine nonlinear discrete-time as follows: $x_{k+1}=F\\left(x_k,u_k\\right)\\quad k=0,1,2,\\dots$, where $x_k$ denote the system state, $u_k$ denote the control input and $F(\\cdot)$ be the system dynamic function. Beside, the system state $x_k=0$ is an equilibrium state under the control $u_k=0$. For optimal control problem, consider the following performance index: $J(x_{0})=\\sum\\limits_{l=0}^{\\infty}{U(x_l,u_l)}$, where $U(x,u)=x^{\\mathsf{T}}Qx+u^{\\mathsf{T}}Ru$ is the utility function, $Q$ and $R$ are symmetric positive definite matrices. Thus, $U(x_k,u_k)\\geq 0$ for $\\forall x_k,u_k\\neq 0$. The performance index, also known as the cost function, represents the exception of the total cost in the future. Therefore, the minor cost function indicates the better performance. Additionally, the cost function also named as ‘value’ function, for it is obtained by the approximation of the neural networks. Similarly, the control law $u_k=u(x_k)$ is approximated by neural networks, and its mapping relation is denoted as ‘policy’. If you are careful enough, you would noticed that the upcoming iterative algorithm will be based on the iteration of the ‘value’ function and the control ‘policy’, which are both are both derived from neural networks. Then, the optimal control problem is aims to design the optimal control $u^{\\ast}(x)$ that minimize the value function. It is noted as: $u^{\\ast}(x)=\\arg \\min\\limits_{u} J(x)$, where the $J(x)$ is composed of all system states that driven by the policy $u(x)$ from now on. Based on the definition of the performance index, the value function can be described recursively as $J(x_k)=U(x_k,u_k)+J(x_{k+1})$. Therefore, according to the Bellman optimality principle1,2, the optimal value function satisfies the following discrete-time Hamilton-Jacobi-Bellman function: $J^{\\ast}(x_k)=\\min\\limits_{u(x)}{ U(x_k,u_k)+J^{\\ast}(x_{k+1}) }$. Then, the optimal control is given by $u^{\\ast}(x_k)=\\arg\\min\\limits_{u(x)}{ U(x_k,u_k)+J^{\\ast}(x_{k+1}) }$. Besides, the iterative version of the ‘value’ and ‘policy’ are written as $J^{i}(x_k)$ and $u^i(x_k)$, in which the index $i$ increasing from zero to infinite. Policy IterationThe admissible control law is crucial to the policy iteration, for the developed control scheme not only stabilize the system state, but also make the performance index finite. Here introduce the definition of the admissible control: A control law $u(x_k)$ is defined to be admissible with respect to the cost function on the set $\\mathbb{R}_x$ of $x$, if $u(x)$ is continuous on $\\mathbb{R}_x$, $u(0)=0$, $u(x)$ stabilize the system on $\\mathbb{R}_x$, and $\\forall x_0\\in \\mathbb{R}_x$, $J(x_0)$ is finite. Policy iteration can be divided into two part, policy evaluation and policy improvement. let $u^0(x_k)$ be an arbitrary admissible control policy, practically initialized by neural networks. Constructed by the admissible control policy $u^0(x_k)$, the value function $J^0(x_k)$ is obtained via solving the equation of $J^0(x_k)=U(x_k,u(x_k))+J^0(x_{k+1})$. Actually, this procedure, named as policy evaluation, aim to get the solution of the neural networks’ parameters that approximate the $J(\\cdot)$. Then, through the policy improvement procedure, the control policy is improved during the iteration. It can be shown as $u^1(x_k)=\\arg\\min\\limits_{u_k}{U(x_k,u_k)+J^0(x_{k+1})}$. To conclude, the policy iteration can be described as follows: Step 1. Initialize the admissible control policy $u^0(x_k)$. Step 2. (Policy evaluation) Get the solution of the equation $J^i(x_k)=U(x_k,u^i(x_k))+J^i(x_{k+1})$. Step 3. (Policy improvement) Improve the control policy $u^{i+1}(x_k)=\\arg\\min\\limits_{u_k}{U(x_k,u_k)+J^i(x_{k+1})}$. Step 4. If $|J^{i+1}(x_k)-J^{i}(x_k)|\\leq \\alpha$, stop the iteration, otherwise, go back to step 1 and let $i=i+1$. If the dynamic of the system is accessible, $x_{k+1}$ can be calculated as $x_{k+1}=F(x_k,u_k)$ when $u_k$ is changed. Then the policy evaluation can be reformed as $J^i(x_k)=U(x_k,u^i(x_k))+J^i(F(x_{k},u^i_{k}))$, and this equation can be built based on the knowledge of $x_k$. Moreover, thanks to the accessible system dynamic, the rewritten of the utility function is reasonable after the control policy is changed, the policy improvement procedure can also be reformed. If the system state $x_{k+1}$ can only be observed rather than acquire by calculation, the transaction of ${x_k,u_k,x_{k+1}}$ is fixed when the iteration index $i$ increase. One can not figure out the situation after the control policy $u^i(\\cdot)$ changed, ignorance is all one have. Further study is needed. Value IterationThe admissible control policy is undesired in the value iteration, whereas the value function is initialized as $J^0(x_k)=0$ at the start. Then solve for $u^0(x_k)$ as follows: $u^0(x_k)=\\arg\\min\\limits_{u(x)}{U(x_k,u_k)+J^0(x_{k+1})}$. Then, the value function is get as $J^1(x_k)=U(x_k,u^0_k)+J^0(F(x_k,u^0(x_k)))$. To conclude: Step 1. Initialize the value function $J^0(x_k)=0$. Step 2. (Policy improvement) $u^{i+1}(x_k)=\\arg\\min\\limits_{u_k}{U(x_k,u_k)+J^i(x_{k+1})}$ Step 3. (Policy evaluation) $J^i(x_k)=U(x_k,u^i(x_k))+J^i(x_{k+1})$ Step 4. If $|J^{i+1}(x_k)-J^{i}(x_k)|\\leq \\alpha$, stop the iteration, otherwise, go back to step 1 and let $i=i+1$. [1] F. L. Lewis, D. Vrabie, and V. L. Syrmos, Optimal Control. Hoboken, NJ, USA: Wiley, 2013. [2] D. P. Bertsekas, Dynamic Programming and Optimal Control. Belmont, MA, USA: Athena Sci., 2005. [3] D. Liu and Q. Wei, “Policy iteration adaptive dynamic programming algorithm for discrete-time nonlinear systems,” IEEE Transactions on Neural Networks and Learning Systems, vol. 25, no. 3, pp. 621–634, 2013. [4] A. Al-Tamimi, F. L. Lewis, and M. Abu-Khalaf, “Discrete-time nonlinear HJB solution using approximate dynamic programming: Convergence proof,” IEEE Transactions on Systems, Man, and Cybernetics, Part B Cybernetics, vol. 38, no. 4, pp. 943–949, 2008. [5] B. Luo, Y. Yang, H. N. Wu and et al, “Balancing value iteration and policy iteration for discrete-time control,” IEEE Transactions on Systems, Man, and Cybernetics: Systems, vol. 50, no. 11, pp.3938-3958, 2019.","categories":[{"name":"学习","slug":"Study","permalink":"https://benderay.github.io/categories/Study/"}],"tags":[{"name":"学习","slug":"Study","permalink":"https://benderay.github.io/tags/Study/"}]},{"title":"用Anki自建单词卡","slug":"用Anki自建单词卡","date":"2019-10-06T10:06:51.000Z","updated":"2019-10-06T12:06:20.498Z","comments":true,"path":"2019/10/06/用Anki自建单词卡/","link":"","permalink":"https://benderay.github.io/2019/10/06/用Anki自建单词卡/","excerpt":"","text":"Anki是一款非常好用的记忆软件，可以在PC端、移动端（IOS/Android）同步使用。通过翻问题卡可以帮助使用者记住答案。本文介绍了如何通过Anki软件中的WordQuery插件快速制作属于我们自己的单词卡集。简而言之，就是通过文档中的方法将excel中收集的单词批量变成有声有完美释义的单词卡 相关链接：Anki软件的官方软件链接 WordQuery插件的使用教程、中文教程 制作步骤： 安装Anki软件：通过Anki官网下载 在Anki中安装插件WordQuery： 在Anki软件中点击 [工具]–&gt;[添加附件]–&gt;[获取插件]–&gt;[输入插件安装代码] WordQuery插件的安装代码：775418273 按照WordQuery插件的使用中文教程中的提示进行如下操作： 3.1 添加词典（可选） 推荐一个下载专业词典的网站：MDict，词典一般是.mdx格式的，推荐下载最新版的牛津高阶英汉词典。另外推荐一下查词软件欧陆词典，也可以在欧陆词典中添加自己下载的词典资源。 3.2 选择单词卡模板（Choose Note type） 单词卡的模板可以在网上搜到，我在这里分享一个比较素净的配置。 在Anki软件中点击 [工具]–&gt;[管理笔记类型]–&gt;[卡片]，即可新建新的笔记类型（单词卡样式）。 正面模板： 123456&lt;div style=\"font-size:50px;font-family:arial black\"&gt;&#123;&#123;单词&#125;&#125;&lt;/div&gt; &lt;div style=\"font-size:15px; color: blue;\"&gt;&#123;&#123;音标&#125;&#125;&#123;&#123;发音&#125;&#125;&lt;/div&gt; 格式刷（卡片格式共享） 1234567.card &#123;font-family: arial;font-size: 20px;text-align: center;color: black;background-color: white;&#125; 背面模板 12345678910&#123;&#123;FrontSide&#125;&#125;&lt;hr id=answer&gt;&lt;br&gt;&lt;div style=\"color:purple;\" align=\"left\"&gt;&#123;&#123;释义&#125;&#125;&lt;/div&gt;&lt;br&gt;&lt;div style=\"font-size=smaller\" align=\"left\"&gt;&#123;&#123;牛津&#125;&#125;&lt;/div&gt;&lt;br&gt;&lt;div align=\"left\"&gt;&#123;&#123;柯林斯&#125;&#125;&lt;/div&gt; 3.3 对模板中的字段关联资源 WordQuery插件可以给某一笔记类型中的字段设置需要补充的资源，可以添加本地词典资源和网络词典资源。 设置好之后，在Anki软件中只输入单词字段，然后点击Query选项就可以自动生成剩下的空白资源，这样就可以完美的给单词卡添加单词发音所需的媒体文件。 批量添加单词卡 4.1 将需要制作的单词按列依次输入excel文件中。 4.2 新建一个记事本文件，将excel文件中的单词粘贴到记事本(.txt)中，将该记事本文件另存为UTF-8编码的记事本(.txt)文件。 4.3 在Anki中直接导入UTF-8编码的记事本文件。 4.4 在Anki中浏览刚添加的单词，全部选中需要转换的单词，点击WordQuery中的Query Selected进行转换。 Anki使用的注意事项不喜欢Anki同步功能的人，在PC端做好单词卡以后通过Anki的导出功能导出.akpg文件到手机的时候，没有选同时导出媒体文件就导致在手机上学习的时候没有单词发音。 喜欢Anki同步功能的人，背完一套单词卡删掉换另一套的时候会发现同步的过程需要超长时间，有可能是删掉这套单词卡的时候单词卡中的发音等媒体文件在云端没有删除干净。点击 [工具]–&gt;[检查媒体]就可以检查是不是有没有关联单词的媒体文件没有删掉，然后选择删掉就好了。 Anki的同步功能很好用，使用同步功能可以在网页/手机客户端/电脑客户端随时学习单词。直接打开Anki的网页端就可以随时学习同步学习进度了。","categories":[{"name":"学习","slug":"Study","permalink":"https://benderay.github.io/categories/Study/"}],"tags":[{"name":"学习","slug":"Study","permalink":"https://benderay.github.io/tags/Study/"}]},{"title":"西藏旅行","slug":"西藏旅行","date":"2019-10-04T12:14:29.000Z","updated":"2019-10-04T13:19:03.938Z","comments":true,"path":"2019/10/04/西藏旅行/","link":"","permalink":"https://benderay.github.io/2019/10/04/西藏旅行/","excerpt":"","text":"高反的预防西藏海拔高，空气含氧量低干燥是让人身体不舒服甚至引发高原反应的原因。血液含氧量低，耗氧高的人容易高反。据我自己的感觉，休息不能缓解的头疼（类似一阵一阵的神经痛）就是高反，我光吃头疼药（布洛芬缓释片）就好了，之后也没有疼。推荐一篇关于高原反应的知乎回答：链接：如何预防高原反应？- 非典型土人的回答 - 知乎 血氧 可以带一个血氧仪随时检测记录血氧浓度，我是手机可以测血氧，在内地血氧97％左右，在拉萨血氧87％左右，轻微头胀，心跳要快一些，时间久了会有手麻的感觉。血氧小于70％就相当危险了，要及时吸氧缓解，我自己的情况是在拉萨静息状态下吸2~3次氧气，可以增加4%左右的血氧浓度。便携高压氧气罐不能带上飞机和火车，如果自驾游的话可以买车载制氧机。到了拉萨需要买氧气的话便携氧气瓶是30～50块左右一瓶，850ml大小的氧气瓶大概可以吸200下左右，也可以买可以反复充装的氧气袋55块左右，装一次氧气5块左右。要留意一些景点的安检要求比如布达拉宫不可以带氧气，但是布达拉宫的半山腰有景区提供的氧气。导致高原反应的血氧含量因人而异，如果在拉萨血氧含量就很低的话，到更高海拔地区之前最好准备一点氧气。 药品 可以准备一些头疼药比如布洛芬，买一点葡萄糖口服液防止低糖头晕。红景天在进入高原地区之前可以服用一点，但是到了高原地区出现高原反应的情况的时候就没什么用了。建议进入高原地区要问一下当地的医生备一点药，如果出现严重的身体不适最好尽快就医和降低海拔。自驾游要留意沿途大的乡镇的位置和诊所的情况。 饮食起居 在西藏会胃口不好，要多吃一些高碳水的食物类似米面和糖等等，多吃好消化的东西。可以带一点巧克力保持体力充沛，注意每顿饭不要吃的太饱。在拉萨的酒店一般都会有加湿器，西藏空气干燥要多开加湿器。西藏的阳光也很毒紫外线强，出门要戴墨镜抹防晒霜。到了西藏不要洗澡，千万不能在身体感冒的时候进入高原地区。在高原我自己的感觉是慢慢走路的时候身体的感觉就像是在慢跑一样，所以到了高原千万不要剧烈运动（比如唱、跳、跑步、喝酒）。在高原要多喝水多上厕所，也可以多喝一点当地的甜茶，在拉萨有很多的甜茶馆。身体乏困可以泡一点西洋参片喝，但是我自己来说喝西洋参会上火然后就流鼻血了，还有就是喝藏红花也会流鼻血但不知道为啥。 进入西藏的三种途径火车/飞机/自驾里面，火车和自驾可以帮助适应高原，但是路途颠簸也容易让人不舒服。大概自驾到西藏需要3~4天，火车40+小时。据拉萨的司机师傅说在建的川藏铁路通车后可以坐动车进藏。拉萨的海拔高度在3.7km左右，林芝地区的海拔在2.8km左右，日喀则地区的海拔在4km以上。平均来看西藏北部要比西藏南部的海拔要高一些。日喀则和拉萨都有机场和火车站，林芝只有机场。 另外推荐一个高原反应自测表：点击查看。在自测表中给出了一些评价指标，可以按照评价指标判断自己的身体状况。 景点照片羊卓雍错羊卓雍错也叫羊湖，在羊湖观景台的这一边有一个村子，在湖的那一边也有一个村子。两个村子之间靠着一条小船通行。 巴松措巴松措在林芝的西北边，在湖边有很长的步行走廊，湖边有一个湖心岛，步行走廊的一些地方可以看到远处的雪山。 布达拉宫布达拉宫需要预约，可以从官网预约也可以找旅行社预约。找旅行社预约的好处是可以找一个导游做解说，不然看古代宫殿太枯燥了。布达拉宫的安检很严格，不可以带瓶装水和氧气罐，但是可以带水杯，景区在半山腰给困难的游客可以体提供吸氧。 南迦巴瓦峰南迦巴瓦峰经常被云遮挡，所以不容易被游客看到。好的观赏地点是在去雅鲁藏布江大峡谷的同时观赏南迦巴瓦峰。我特别有幸能在日出的时候看到南迦巴瓦峰的出现，然而仅仅过了半个小时左右，南迦巴瓦峰就被渐渐被云遮挡了。 自然风景","categories":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/categories/inadvertently/"}],"tags":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/tags/inadvertently/"}]},{"title":"臆想中做一次“生与死”的选择","slug":"臆想中做一次“生与死”的选择","date":"2019-04-02T08:27:30.000Z","updated":"2019-04-02T12:02:57.800Z","comments":true,"path":"2019/04/02/臆想中做一次“生与死”的选择/","link":"","permalink":"https://benderay.github.io/2019/04/02/臆想中做一次“生与死”的选择/","excerpt":"","text":"推荐一部动画作品《新世纪福音战士》(Neon Genesis Evangelion)，是一部轰动一时的1995年的日本科幻作品。推荐观看顺序是TV版的[1-24]集以及最终1997年上映的《新世纪福音战士：END OF EVANGELION》。原因在于TV版的最后两集25集和26集由于95年的经费紧张所以并没有把结局讲完整，而97年出品的剧场版是完整叙述了导演未完成的故事。我会从故事背景/主要角色这两个角度来叙述这部动画，在最后会有小部分的对于故事的解读，当然了我没有时间反复去看这部动画的，都是我在看了一些网友的解读，最后整理出来的我喜欢的一些看法分享出来。 故事背景：故事中有个很重要的概念就是使徒，使徒可以被看做是上帝创造的生物及其衍生物。一共有18位使徒，第一使徒是亚当，亚当衍生了从第三使徒到第十七使徒。第二使徒是莉莉丝，衍生了第十八使徒人类。亚当和莉莉丝在犹太教的教义中是上帝最早创造的一对夫妻，但在剧中也没有这样说明，作者可能只是打宗教神秘的擦边球。于是现在18个使徒分为了两派，亚当一派和莉莉丝一派，其中人类作为第十八使徒和莉莉丝是一派，亚当和其余的16个使徒是一派，每一派都想回归自己的母体来达到进化并实现占领地球的愿望。于是人类某个可以背后很有资源的一帮人(SEELE)建立了“人类补完计划”来实现人类在莉莉丝苏醒后回归莉莉丝的接触。所以人类要干掉从亚当衍生出来的所有使徒，于是人类创造EVA这一亚当身体的复制品，并用拘束器限制了亚当身体真正的力量，动画中呈现出来的就是一个高大的人形外壳机甲。但EVA却没有灵魂和思考的能力，靠将人插入EVA的脊髓用人的神经控制EVA巨大身躯进行对其他使徒的消灭。于是SEELE希望通过EVA消灭所有的使徒，并最后通过某种仪式让全体人类融为一体形成一个单一的进化的生命体。 故事源于第二次冲击(西历2000年)，人类在南极进行了针对亚当(Adam：第一使徒)的接触实验造成了亚当的暴走，引发了第二次冲击，当时造成了南极的破坏，地球磁场偏转，气候发生剧烈变化。而第二次冲击之后的南极，冰川全部融化，在以南极为中心的一定范围内暴露在空气中的生物都无法生存，此时的南极就如同人间地狱一般。同时地球上的一半的人类都没能在第二次冲击中生存下来，在南极科考基地中只有葛城美里活了下来成为了最后指挥EVA的NERV的作战部长。 而第二次冲击虽然是天灾倒不如说是SEELE所为，这是因为SEELE在南极的科考中发现了沉睡中的亚当的身体的同时还发现了“朗基努斯之枪”和《死海古卷》。从《死海古卷》中SEELE得知了使徒要回归眼前这个巨人亚当消灭人类的秘密，于是故意使用朗基努斯之枪和人类的DNA插入亚当身体引发亚当的暴走，并破裂分散成亚当的灵魂和亚当的血肉。同时，SEELE收集了亚当的灵魂并将其注入复制人的体内变成了第十七使徒：诸薰。 在第二次冲击之后，SEELE主持并直到建立了NREV的一系列研究，而EVA就是其中E计划的产物，并用来避免使徒回归亚当进而导致第三次冲击的发生。而使徒被亚当暴走炸裂后散发的能量所唤醒开始孵化，并在2015年的时候成形开始寻找亚当。而亚当已经被SEELE在胚胎的状态下封起来了，此时孵化成形的使徒只能感受到第二使徒莉莉丝，于是认为这个巨大能量体就是亚当便纷纷前来完成自己的回归。 在故事中，NERV在莉莉丝身处的黑之月的上层建立了第三新东京市作为防御使徒的战略要塞。随后凭借第三新东京市和三台EVA的配合击退了第三到第十六使徒。而三台EVA分别是零号机、初号机和二号机。零号机和二号机的身体都是由亚当复制而来，初号机的身体则是由莉莉丝复制而来。零号机的驾驶员是绫波丽，初号机的驾驶员是碇真嗣，二号机的驾驶员是明日香。其中零号机驾驶员绫波丽是碇真嗣的母亲碇唯的复制人但是没有灵魂，而灵魂则是取自黑之月底层的二号使徒莉莉丝。碇真嗣的母亲碇唯在初号机的一次插入实验中被初号机吸收。初号机因为吸入了碇真嗣的母亲所以选由碇真嗣作为驾驶员。二号机则是因为明日香的母亲在插入实验中被EVA捕获了部分的精神，于是选择明日香来担任二号机的驾驶，而明日香的母亲也在实验之后患上了精神病终日将一只玩偶当作女儿明日香，并在明日香被选为二号机驾驶员的当天自杀。 人物经历碇真嗣 碇真嗣在年幼的时候母亲被吸入EVA，父亲将其寄养在一位老师家中，从小真嗣便不会与人交流，性格孤僻，总是随身携带一个随身听沉浸在自己的世界中。之后被父亲叫到第三新东京市驾驶EVA对抗使徒，在与使徒对抗的过程中，碇真嗣在不断的逃避EVA初号机驾驶员的身份，并最后找到了驾驶EVA的动力–来自严厉的NREV所长父亲碇源堂的认同。但在之后的战斗中，同班同学铃原冬二被选中驾驶EVA出事、绫波丽的自爆、明日香精神失常，真嗣显得孤立无援并再次逃避驾驶EVA。 绫波丽 绫波丽作为复制人，在与碇真嗣有了一些的交集之后，慢慢的拥有了自己的想法与意识，在一次与使徒的交战中自爆牺牲了自己。当绫波丽作为新的复制人被唤醒之后，回想起了与碇真嗣的点点滴滴，逐渐的有了自己的意识并在最后拒绝了NERV所长碇原渡的计划，将故事的发展命运交给了碇真嗣。 明日香 明日香在母亲疯掉之后就以驾驶EVA打败使徒为荣，而且在生活中处处要强，痴迷于他人的崇拜，15岁就已经精通德语日语，并且修完大学的所有课程。对明日香来说，驾驶EVA并成为第一就是在证明自己的存在，如果没有EVA明日香便一无所有。但是在碇真嗣的成绩逐渐追上她的时候，开始自暴自弃逐渐丧失了自信心，渐渐的失去了EVA驾驶员的资格。但是在故事的结尾，明日香在二号机中感受到了母亲的气息，受到了鼓舞，突然间重新振作了起来。 故事来到了结局SEELE在察觉到NREV背叛了自己的时候，派出诸薰帮他们铲除NREV但是失败了，后来就动用了军队和10台EVA量产五号机杀向NREV的总部第三新东京市。明日香重新振作之后逐个击破了10台量产EVA五号机，NREV全体和杀来的军队交火，此时真嗣在EVA初号机旁犹豫不决。碇源堂带着绫波丽来到了莉莉丝的面前，企图用自己手上移植的亚当胚胎和绫波丽结合并最终控制莉莉丝进行人类补完计划。碇源堂希望通过控制整个补完计划，避免SEELE计划全体人类回归莉莉丝形成一个没有隔阂的单体生物的目的。 被明日香破坏的EVA量产机突然重新开始活动，打倒二号机之后又再一次将二号机肢解的粉碎。真嗣在初号机中看到二号机的残骸当场崩溃，初号机展开红色羽翼，SEELE开始以初号机完成人类补完计划。而绫波丽通过自己意识，从碇源堂手中夺取了亚当的胚胎，并回归到了莉莉丝体内。莉莉丝化作绫波丽的身形不断变大，莉莉丝站在初号机的面前，将人类的命运重新交给了碇真嗣和初号机。真嗣陷入了自我意识中，他发现在自己的回忆中他总是孤身一人，脆弱的真嗣向幻想中的明日香求救。真嗣陷入了混乱，他厌恶自己厌恶他人，最终他在与明日香的回忆中，发泄愤怒掐死了明日香，逐渐产生了所有人都去死的念头。最终莉莉丝开始了人类补完计划，所有的人都化作了LCL溶液回归了生命最原始的样子。所有人的灵魂也回归了莉莉丝体内形成了一体。在没有自我意识存在的环境中，真嗣见到了绫波丽也见到了诸薰，真嗣开始希望能重新见到曾经的同学和朋友。于是初号机飞出莉莉丝的身体，莉莉丝破裂人类的灵魂重新回到地球。所有人都可以依照自己心中所想的模样还原自己的身体。 那我的梦在哪，那是现实的延续那我的现实在哪，那是梦的终结 躺在沙滩上、回过神来的真嗣，发现周围只有身旁的明日香。 真嗣突然掐住明日香的脖子。明日香仍是面无表情地凝视着天空，并没有反抗，反而伸出手抚摸真嗣的脸，真嗣终于哭着松开了手。在他哭泣的时候，明日香的目光移向他，口中只轻轻地吐出了一句话：“真恶心。” 伴着开头与结尾真嗣看到的远处绫波丽忽隐忽现的身影，故事不过是主人公的臆想而已。在剧中，明日香一直很喜欢加持良治，但是加持良治只是把她当作一个小孩子，在加持良治与照看明日香和真嗣的葛城美里出去约会的时候。明日香和真嗣在家无聊于是要求和真嗣接吻，明日香提着真嗣的鼻子就亲了上去，亲完之后明日香一溜烟跑回了房间。 剧中提出了一个刺猬效益（豪猪效应），想要相互取暖的刺猬只要靠的太近就会伤害到彼此，所以它们只能保持一定距离。放到人与人之间也是如此，我们无法离彼此太过于接近，只好保持一定的距离。SEELE因为这种距离选择了全体溶于一体的命运，而真嗣觉得这种无距离的关系又太不真实。对真嗣而言，他是如此的害怕孤单希望别人的接近，但是最后还是选择了人与人相互隔阂互相不易理解的世界。故事中的冲突也因为明日香强吻真嗣之后开始变得激烈，两个渴望他人亲近的人在亲近之后变得逐渐疏远。","categories":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/categories/inadvertently/"}],"tags":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/tags/inadvertently/"}]},{"title":"喝牛奶的一些操作","slug":"喝牛奶的一些操作","date":"2018-05-25T11:25:44.000Z","updated":"2019-01-11T03:24:05.332Z","comments":true,"path":"2018/05/25/喝牛奶的一些操作/","link":"","permalink":"https://benderay.github.io/2018/05/25/喝牛奶的一些操作/","excerpt":"","text":"博主爱喝牛奶，但是喝完就会肚胀，这个事情还挺恼人的，于是就这个事情进行一次小小的探索 简单的查了一下，应该是乳糖不耐受的问题，而且亚洲大部分的人都有成年后乳糖不耐受的症状。 什么是乳糖不耐受？ 乳糖不耐受是由于体内缺乏乳糖酶，导致小肠内少量的乳糖酶不能把牛奶中的乳糖完全分解出现的问题。食物中的乳糖进入小肠以后，乳糖不能被分解为单糖并吸收到血液中，结果乳糖继续往下走到了结肠和细菌反应就变成了短链有机酸和各种气体。哎！肚子这就开始胀了，也许还会放个屁。王宝强和徐峥的电影《泰囧》里面，王宝宝在机场安检干了4升鲜奶之后，转战飞机起飞之后直接把牛奶又交了出来。 其实我们都是从小喝奶长大的，如果有乳糖不耐受的问题那不是自己给自己设BUG吗？其实人乳中乳糖含量6.7%，牛乳中乳糖含量4.8%，牛奶里还乳糖含量少呢。其实，对一个正常人来说，还是小宝宝的时候体内是有大量乳糖酶的存在，但是由于断奶之后饮食环境的改变，体内的乳糖酶会越来越少。有些说法是你到了一定的年龄，你的基因有个开关就把你的乳糖酶给断了。不过有一份实际的文献显示乳糖酶缺乏的情况在人群中随着年龄的增加而增加，这份文献是作者关晓晖对吉林省的调查。大概数据是乳糖酶的缺乏在16岁之前的群体中大概是25%，16~20岁33%，20~40岁50%。不过也有文献指出北京地区这个数据更惨，应该是和饮食环境有很大关系。所以上初中上高中的时候喝一波奶还是很有帮助的。 哎呀就想喝奶，想到睡不着怎么办 喝牛奶当然很棒棒，尤其是睡前半小时喝300ml以下的牛奶特别好。第一，好在牛奶可以让人容易产生疲倦的感觉，以及帮助人可以更容易镇定下来，可以很大程度的帮助睡眠；第二喝奶可以补钙啊，每天晚上人体内的血液的钙浓度会下降，身体就会从骨质中调度一些钙出来维持血液钙浓度，喝奶喝到的钙就可以补充这部分钙浓度下降。 所以青春不再，乳糖酶缺失油腻的人生该怎么办啊？一种思路可以减少喝奶的需求，一种思路可以增加体内的乳糖酶含量。减少喝奶的需求可以采用含蓄喝奶的方式，小口多次；还可以购买不含乳糖的牛奶，但口感总差那么点。增加乳糖酶的思路呢，用酸奶代替牛奶，发酵不就是菌把糖吃掉的过程吗；服用乳糖酶，不过这条很鸡肋，倒是可以在肚子里养一些其他的菌去消灭乳糖，有人说多喝酸奶就能在体内培养这个环境；亦或是直接刚牛奶，任它在肚子里面翻滚造气，多来几遍你的肚子里面就会适应你常常喝奶的造作了。","categories":[{"name":"一点技巧","slug":"Tips","permalink":"https://benderay.github.io/categories/Tips/"}],"tags":[{"name":"一点技巧","slug":"Tips","permalink":"https://benderay.github.io/tags/Tips/"}]},{"title":"对于焦虑的一些想法","slug":"对于焦虑的一些想法","date":"2018-05-16T13:23:34.000Z","updated":"2019-01-11T03:19:08.031Z","comments":true,"path":"2018/05/16/对于焦虑的一些想法/","link":"","permalink":"https://benderay.github.io/2018/05/16/对于焦虑的一些想法/","excerpt":"","text":"对于我来说，可以追溯的最早的一次焦虑大概是小小的时候刚学会说话那一阵子，在家长的回忆中我突然开始哭了起来，家长问我：为什么哭啊？当时我回答不开心很难受之类的，总之没有缘由。现在觉得就是小的时候对快乐的感觉不连续了，就不开心了，然后渐渐开始发愁。 现在年过20，快乐和小时候比起来变得更加复杂了，连续的快乐又不会经常有。不仅如此，还有更多的麻烦事让我们心里更难快乐起来，还有时候都不记得简单的快乐是什么样子了。是不是可以大胆的假设解决焦虑的办法就是给自己创造尽量多的快乐呢？但是现实环境显然不能让我们一直快乐下去，比如我们需要努力工作贴补家用、电视剧不会因为你一个人光速更新、想吃的美食有时候还与你相隔千里。那么可以说一个人不是追求焦虑感的话，他大多数时候是带有一点点被动焦虑的，他需要解决比焦虑更重要的东西就没法避开焦虑。所以，面对焦虑的时候就要迎难而上，解决焦虑就是找到它，找到最焦虑的部分去解决。 因为每个人的焦虑情况都不一样，以至于有些对于个人来说不可控的事情带来的焦虑是无法避免的。那不就需要一些法子去更新一波大脑，把节奏控制在大脑以下。出去散步、打游戏都可以是一种选择。但是一定要记得自己只是在慢慢长路上的小小休息而已，焦虑感还远远没有被战胜，就需要快速解决调整自己的状态，再回去与焦虑战斗。那么，跑步游泳在短时间的收获感上就似乎要高于打游戏的感觉，力竭之后岂不是更加心旷神怡。","categories":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/categories/inadvertently/"}],"tags":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/tags/inadvertently/"}]},{"title":"随笔2018年4月29日","slug":"随笔2018年4月29日","date":"2018-05-10T14:03:21.000Z","updated":"2019-01-11T03:19:15.577Z","comments":true,"path":"2018/05/10/随笔2018年4月29日/","link":"","permalink":"https://benderay.github.io/2018/05/10/随笔2018年4月29日/","excerpt":"","text":"这篇是之前写了一点，但是一直觉得不好就没有发，今天稍稍加了点东西才发上来的 最近有一部电影上映，歌手刘若英执导的第一部电影《后来的我们》，很久没有去影院看过这种类型的电影了。电影从三首推广曲开始就博人眼球，但是博主是不打算去看这部电影的。偶然看到对这部电影的一个评价以及对情感类电影的一句总结很有意思。 “前任就是最好的摇钱树“ 从三首推广曲下的网友评论可以看出这部电影在推出之后，也许有《前任3》上映之后那种催泪奇效，一堆人在结束放映的时候哭晕在影院，在路灯下嘶声裂肺的唱影片主题曲。然后就是很多“我很想你，但是我们不能在一起了“这样的话。但这到底算不算的上是一种对前任的克制呢？其实说这句的时候，后半句就是一句废话。比方说我们不能在一起了原因有二。对对方的感情已经不再，而且对方做过很多伤害自己的事情，那前半句也是一句废话。其次，现实环境导致彼此不能在一起，相应的选择就可以是克服环境走到一起，以及保持现状，那前半句也是一句废话。那前半句肯定是废话的话，为什么还要说一说才行，其实后半句也是一句废话。 之前也有一部电影，我看过的，叫《One Day》。这部电影我起码刷了有三遍，男主的浪子回头和女主最后走在一起的戏码让我是心里一遍又一遍的翻起波澜。但是越吸引人的剧情，越能让人引起共鸣的就越不能代表我们的生活。其实我们的执迷，都是对虚构情结的一种幻想，我们内心的渴望告诉我们这不是真实大概率发生的事件。而在《One Day》中，其实最打动我的一段就是男主女主两人以朋友的身份一起开一辆车公路出游那一段，如果你也去看一看的话，这一段才是整部剧中让人平静享受的一段。而这一段不就是最贴近现实生活的模版吗，没有男主也没有女主，只有两个人开车上路。这种可以平静的享受","categories":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/categories/inadvertently/"}],"tags":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/tags/inadvertently/"}]},{"title":"电力电子公式总结","slug":"电力电子公式总结","date":"2018-05-03T05:21:00.000Z","updated":"2018-05-03T05:30:53.207Z","comments":true,"path":"2018/05/03/电力电子公式总结/","link":"","permalink":"https://benderay.github.io/2018/05/03/电力电子公式总结/","excerpt":"","text":"整理电脑的时候发现的好东西，不过都是之前手打的不免有错误 晶闸管 电流平均值 $$I_{T(AV)}=\\frac{1}{2\\pi}\\int_0^\\pi I_m\\sin{\\omega t}d\\omega t=\\frac{I_m}{\\pi}$$ 电流有效值 $$I=\\sqrt{\\frac{1}{2\\pi}\\int_0^\\pi (I_m\\sin{\\omega t})^2d\\omega t }=\\frac{I_m}{2}$$ 单相桥式全控 电阻负载 负载电压平均值 $$U_d=\\frac{1}{π}\\int_{\\alpha}^{\\pi} \\sqrt{2} U_2\\sin\\left({\\omega t} \\right)d\\left(\\omega t\\right)=0.9U_2\\frac{1+\\cos \\alpha}{2}$$ 负载电流平均值 $$I_d=\\frac {U_d}{R}$$ 晶闸管电流平均值 $$I_{dVT}=\\frac{1}{2}I_d$$ 晶闸管电流有效值 $$I_{VT}=\\sqrt {\\frac {1}{2\\pi}\\int_{\\alpha}^{\\pi} \\left( \\frac{\\sqrt{2} U_2}{R}\\sin{\\omega t} \\right)^2 d\\left( \\omega t\\right)}$$ 变压器二次侧电流有效值 $$I_2=\\sqrt{2} I_{VT}$$ $$I_2=I_d$$ 阻感负载 负载电压平均值 $$U_d=\\frac{1}{π}\\int_{\\alpha}^{\\pi+\\alpha} \\sqrt{2} U_2\\sin\\left({\\omega t}\\right)d\\left(\\omega t\\right)=0.9U_2\\cos{\\alpha}$$ 负载电流平均值 $$I_d=\\frac {U_d}{R}$$ 晶闸管电流平均值 $$I_{dVT}=\\frac{1}{2}I_d$$ 晶闸管电流有效值 $$I_{VT}=\\frac{1}{\\sqrt2} I_d$$ 变压器二次侧电流有效值 $$I_2=I_d$$ 三相可控整流 三相电波形 $$U_a=\\sqrt{2}U_2 \\sin{\\omega t}$$ $$U_b=\\sqrt{2}U_2 \\sin{\\left(\\omega t-120^{\\circ}\\right)}$$ $$U_a=\\sqrt{2}U_2 \\sin{\\left(\\omega t-240^{\\circ}\\right)}$$ 三相线电压是 $U_{ab}$ 下标从 ab , ac ,bc , ba , ca , cb 止 三相半波可控整流 电阻负载 负载电压平均值 $\\alpha&lt;30^\\circ$ $$U_d=\\frac{1}{\\frac{2 \\pi}{3}}\\int_{\\frac{\\pi}{6}+\\alpha}^{\\frac{5\\pi}{6}+\\alpha} \\sqrt{2}U_2 \\sin{\\omega t}d(\\omega t)=1.17U_2\\cos\\alpha$$ $\\alpha&gt;30^\\circ$波形变短 $$U_d=\\frac{1}{\\frac{2 \\pi}{3}}\\int_{\\frac{\\pi}{6}+\\alpha}^{\\pi} \\sqrt{2}U_2 \\sin{\\omega t}d(\\omega t)$$ 晶闸管承受最大正向电压 $$U_{FM}=\\sqrt{2}U_2$$ 晶闸管承受最大反向电压 $$U_{RM}=\\sqrt3 \\times \\sqrt 2U_2$$ 最大的作变压器二次侧最大电压 负载电流平均值 $$I_d=\\frac{U_d}{R}$$ 晶闸管电流平均值 $$I_{dVT}=\\frac{1}{3}\\frac{U_d}{R}$$ 晶闸管电流有效值 $$I_{VT}=\\frac{1}{\\sqrt3}I_d$$ 阻感负载 负载电压平均值 $$U_d=\\frac{1}{\\frac{2 \\pi}{3}}\\int_{\\frac{\\pi}{6}+\\alpha}^{\\frac{5\\pi}{6}+\\alpha} \\sqrt{2}U_2 \\sin{\\omega t}d(\\omega t)=1.17U_2\\cos{}\\alpha$$ 负载电流平均值 $$I_d=\\frac{U_d}{R}$$ 晶闸管电流平均值 $$I_{dVT}=\\frac{1}{3}\\frac{U_d}{R}$$ 晶闸管电流有效值 $$I_{VT}=\\frac{1}{\\sqrt 3}I_d$$ 晶闸管最大正、反向电压峰值 $$U_{FM}=U_{RM}=\\sqrt3 \\times \\sqrt 2U_2$$ 三相桥式全控整流电路 电阻负载 负载电压平均值 α&lt;=60 $$U_d=\\frac{1}{\\frac{\\pi}{3}}\\int_{\\frac\\pi3 +\\alpha}^{\\frac{2\\pi}{3}+\\alpha} \\sqrt{6}U_2\\sin{\\omega t}d(\\omega t)=2.34U_2\\cos{\\alpha}$$ α&gt;60 波行变短 $$U_d=\\frac{1}{\\frac{\\pi}{3}}\\int_{\\frac\\pi3 +\\alpha}^{\\pi} \\sqrt{6}U_2\\sin{\\omega t}d(\\omega t)$$ 负载电流平均值 $$I_d=\\frac{U_d}{R}$$ 晶闸管电流平均值 $$I_{dVT}=\\frac{1}{3}\\frac{U_d}{R}$$ 晶闸管电流有效值 $$I_{VT}=\\frac{1}{\\sqrt 3}I_d$$ 晶闸管最大正、反向电压峰值 $$U_{FM}=U_{RM}=\\sqrt3 \\times \\sqrt 2U_2$$ 阻感负载 负载电压平均值 $$U_d=\\frac{1}{\\frac{\\pi}{3}}\\int_{\\frac\\pi3 +\\alpha}^{\\frac{2\\pi}{3}+\\alpha} \\sqrt{6}U_2\\sin{\\omega t}d(\\omega t)=2.34U_2\\cos{\\alpha}$$ 负载电流平均值 $$I_d=\\frac{U_d}{R}$$ 晶闸管电流平均值 $$I_{dVT}=\\frac{1}{3}\\frac{U_d}{R}$$ 晶闸管电流有效值 $$I_{VT}=\\frac{1}{\\sqrt 3}I_d$$ 变压器二次侧电流有效值 $$I_2=\\sqrt{\\frac23} I_d$$ 晶闸管最大正、反向电压峰值 $$U_{FM}=U_{RM}=\\sqrt3 \\times \\sqrt 2U_2$$ 三相有源逆变 负载电压平均值 $$U_d=-2.34U_2\\cos{\\beta}=2.34U_2\\cos{\\alpha}$$ 输出电流平均值 $$I_d=\\frac{U_d-E}{R}$$ 三相逆变 180逆变 相电压 $$U_{A0}=\\sqrt{ \\frac{1}{2\\pi}[ (\\frac13 U_d )^2\\cdot \\frac43 \\pi + (\\frac{2}{3}U_d)^2 \\cdot\\frac{2}{3}\\pi]}=0.471U_d$$ 线电压 $$U_{AB}=\\sqrt{\\frac1{2\\pi}U_d^2 \\cdot \\frac{4\\pi}{3} }=0.817U_d$$ PWM调制载波比载波比调制波 $$N=f_c/f_r$$ 特定谐波消去法特定谐波幅值 $$a_n=\\frac4\\pi \\int_0^{\\pi \\over 2} u(\\omega t)\\sin{\\omega t}d(\\omega t)=\\frac{2U_d}{n\\pi}(1-2\\cos{n\\alpha_1+2\\cos{n\\alpha_2-2\\cos{n\\alpha_3}}})$$ 在三相对称电路的线电压中，相电压所含的3次谐波相互抵消 n=1,5,7…. 直流斩波 降压斩波 负载电压平均值 $$U_o=\\frac{t_{on}}{T}E=\\alpha E$$ 负载电流平均值 $$I_o=\\frac{\\alpha E-E_M}{R}$$ 输出电流平均值 $$I_o=\\frac{1}{\\alpha}I_1$$ 功率关系 $$U_oI_o=\\alpha EI_o=EI_1$$ $$EI_ot_{on}=RI_o^2T+E_MI_oT$$ 升压斩波电路 负载电压平均值 $$U_o=\\frac{t_{on}+t_{off}}{t_{off}}E=\\frac{T}{t_{off}}E=\\frac{1}\\beta E$$ 负载电流平均值 $$I_o=\\frac{t_{off}}{T}I_1$$ 功率关系 $$EI_1t_{on}=(U_o-E)I_1t_{off}$$ 升降压斩波 负载电压平均值 $$U_o=\\frac{t_{on}}{t_{off}}E=\\frac{\\alpha}{1-\\alpha}E$$ 负载电流平均值 $$I_o=\\frac{1-\\alpha}{\\alpha}I_I$$ 电感上功率关系 $$Et_{on}=U_ot_{off}$$ 复合斩波 降压状态 $$U_o=\\alpha E$$ 回馈状态 $$U_I=\\frac{1}{\\beta}U_o$$ 桥式可逆斩波单极性 与降压、回馈的一样 桥式可逆斩波双极性 $$U_o=\\frac{t_{on}}{T}E-\\frac{t_{off}}{T}E=(2\\alpha-1)E$$ 交交变频电路要得到的波形为 $$u_o=U_{om}\\sin{\\omega_o t}$$ 设$U_{d0}$为α=0的理想空载电压 则使：$$\\cos{\\alpha}=\\frac{U_{om}}{U_{d0}}\\sin{\\omega_o t}=\\gamma \\sin{\\omega_o t}$$ 由此可得 α 的值","categories":[{"name":"学习","slug":"Study","permalink":"https://benderay.github.io/categories/Study/"}],"tags":[{"name":"学习","slug":"Study","permalink":"https://benderay.github.io/tags/Study/"}]},{"title":"随笔2018年4月26日","slug":"随笔2018年4月26日","date":"2018-04-27T14:55:49.000Z","updated":"2019-01-11T03:20:14.554Z","comments":true,"path":"2018/04/27/随笔2018年4月26日/","link":"","permalink":"https://benderay.github.io/2018/04/27/随笔2018年4月26日/","excerpt":"","text":"最近很幸运可以同时有两部剧可以看，一部《亿万》一部《西部世界》。其实看剧对于我来说还是更爽一些的，不知不觉都已经到了玩游戏都累的时候了。看剧就是从导演的视角去看一个故事，就像看书一样，这件事情我本未曾经历过，但是也让我在角色的切换中找到了另一种生活的环境。 有本书叫《人类简史》，在书的开头，作者描述了当时的各个大陆上生活着不同的人种。可是最后这些人种都被智人也就是现在的我们征服了。我们的脑容量不是最大的，我们的身体不是最健壮的，我们的祖先无处争食只能去吃大型肉食动物剩下的残渣过活，残渣中的大多数都是死去的动物的脑髓。我们就这样不知道怎么就有了虚构的能力，我们幻想出自己种群的神灵，后来我们又虚构出了国家，虚构出了法律，虚构出了文字、书本。不可否认，这些东西都是不实际存在的。 说历史不仅仅是对过去的记录，也是对未来的推演。那对我们自身虚构能力由来的记录是不是也可以让机器去相信自己信仰的主义呢？","categories":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/categories/inadvertently/"}],"tags":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/tags/inadvertently/"}]},{"title":"推荐一首歌 2018.4.18","slug":"推荐一首歌-2018-4-18","date":"2018-04-18T10:13:29.000Z","updated":"2019-01-11T03:21:41.816Z","comments":true,"path":"2018/04/18/推荐一首歌-2018-4-18/","link":"","permalink":"https://benderay.github.io/2018/04/18/推荐一首歌-2018-4-18/","excerpt":"","text":"平时就喜欢和朋友分享喜欢的音乐，在博客里就可以长篇大论的聊一聊喜欢的歌了！ 今天这首歌是早上吃饭路上想起来的，第一次听的时候，还觉得这歌真有病，后来就越来越喜欢了。一切都从CS开始，那个单纯的年纪CS还是Counter-Strike的简写，聊天的时候不需要解释的。现在居然有个Computer-Sience也CS、CS的叫，人心不古物是人非啊！就是当时很喜欢玩CS，后来接触到了CF，然后当时就喜欢每两个月攒10块冲到游戏里。每月抽个5块钱的奖，抽到什么枪啊无所谓，一般都是抽到30天有效期的装备，反正不影响我发挥。 然后有一天在冲完10Q币之后似乎隐隐的看到腾讯送绿钻的活动，然后不知道怎么的这个绿钻还是花了我的钱，直接透支了两个月花钱抽奖的兴奋点。然后我就喜欢上听歌了，总之还是一通周杰伦，还有许嵩，一堆Tylor，一些Biber，然后点开了Green Day，觉得这个真的强啊。后来一个关系不错的同学推了一个电影叫《The Boat That Rocked》一时间就听到了很多没听过的特备好听的歌。然后就听到了国内的反光镜特别喜欢，后来似乎是高中了，又听到了中国摇滚榜，空闲的时候就听他们在节目里侃大山特别有意思。这个节目有一个自称是作家的乐评人祁又一，后来不知道怎么和原来的这个节目“中国摇滚榜”呆不下去了，就自己跑到网易云音乐上自己做了电台叫“摇滚又一榜”，然后专心出了几本书，我就没什么时间去看去听了，似乎前一段时间又跑到印度一村里修仙去了。 在一次节目里面就请了反光镜的主场和吉他李鹏做嘉宾，聊当时朋克在国内的发展然后就是一顿瞎扯。今天这首歌是在他们刚成立嚎叫俱乐部时候的一首“无聊军队”。在多次节目里收集到的，李鹏这个人原来是在廊坊的一个国企大院里长大的，后来被一个院里的哥哥带跑偏了，就开始弹吉他扒了火车跑到了北京五道口做音乐去了。混到清华里装留学生偷着洗澡，拉一个床垫就睡朋友家外面了。整个就是无所顾忌的穷开心大概可以描述当时的这些做音乐的，没有任何专业背景，就靠喜欢的那股劲了。 似乎这首歌就是当时的情况，终于有一天，他们不再逃避，挥霍所有年轻的时间去享受无聊。于是只好像个停不下的正反馈，继续抓紧时间去享受无聊。为啥不换句话说，年轻就像我们一样一定要猛猛做自己喜欢的事情。只是我的一个理解，毕竟…我还是小和作者有了些代沟了，可能需要我刚一落地就跑到五道口才行…. 之后李鹏还和一票人组了一个乐队“CURRY 3000”以后可能会有喜欢的东西，但是现在没什么感觉。如果很感兴趣的话，可以去听摇滚又一榜，是一个访谈形式的节目也有新歌打榜的环节。","categories":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/categories/inadvertently/"}],"tags":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/tags/inadvertently/"}]},{"title":"失眠","slug":"失眠","date":"2018-04-11T15:12:28.000Z","updated":"2019-01-11T03:22:39.135Z","comments":true,"path":"2018/04/11/失眠/","link":"","permalink":"https://benderay.github.io/2018/04/11/失眠/","excerpt":"","text":"在也就算是两周前，突然有些失眠。因为刚刚开学，也没什么压力，所以很好奇自己为什么会失眠，结果就是百思不得其解。我开始怀疑自己的身体状况是不是有问题，然后咨询了学医的同学，还买了一瓶睡棒棒精油，似乎我没啥问题，只是有些春季上火。睡棒棒精油还没有用就睡了个8小时，所以我觉得在我下一次睡不好的时候，我就去吃顿好的，同时发现我是一个吃香香之后心情大好的一个人。所以我觉得失眠这种很复杂的毛病，除非到了日常生活都不能进行的时候，也不要特别纠结，倒是在平时应该多纠结自己的日常饮食、生活习惯和作息时间是不是在一个正常的范围。不过真的觉得有一些失眠了还是有一些积极的应对策略比较好。但是真的开始影响个人的生活的时候，一定还是主动看大夫好。 我们从整个失眠的过程来看 我失眠了 首先就是失眠不要慌，不要想着自己在下一分钟就一定要睡着，从脚开始往上慢慢感觉那种轻松的感觉，放松了就好一些了。然后不要有太多纠结的事情，不去想任何事情，让脑袋去感觉睡觉的感觉。也可以激进一波，将周身的不同部位的肌肉紧绷一下直到你觉得没有力气的时候，那你不就累了吗不就想睡了吗。具体怎么紧绷还是放松大家随意吧！ 还没有被睡意征服的话，瞬间睁开眼睛。两眼无光内心毫无波动的呆呆的十分入戏的将此刻的眼神聚焦到屋顶那一片，眼神和屋顶一接触的瞬间就不再分开，彼此深情相伴整晚，情深处眼皮都不愿多眨一下。累了也就有睡意了。 在中医上有一个神奇的穴位叫安眠穴，用手指揉按至感到酸胀就有镇静安神的作用。这个穴位在耳朵后面，将手指并拢，小指放于耳垂下，食指下方就是这个穴。然后按的时候去感觉那种眉头舒展的感觉，就开始管用了。然后揉按的时候可以搭配睡棒棒精油，或者个人喜欢的东西。 此时的如果过去比较久了，还没有入睡的话，就离开床走动走动。打开手机，把屏幕调到护眼模式。浏览器打开 https://theatlantic.com/world/ 开始轮篇的刷。再说了，大学白天那些睡过的课，随便一本仔细翻阅一下。比如数字信号处理书中的 FT,FS,DTFT,DFS 公式抄写抄写怎么不可以，就算没有学过数字信号处理，买一本就可以每天开始看一看了！ 失眠之后 仔细回忆一下最近几天干什么了，有什么会影响到身体的不适，心情的不舒服都可以自己调整一下。比如博主就是吃了一顿就好了，但是不要瞎吃。博主去刷了两天养生粥，而不是两天火锅。主要原则就是吃好吃又适合吃的，比如我就是当时上火，肚子也不是很舒服就喝粥了。心情上….确实当时看不开的后来都看开了。 其实我们都是一个普通人而已，就算不是普通人也最好把自己看作一个普通人，但是我们基本还是普通人。有时候特别烦恼的时候把语境中的老提的那个“我“去掉，生活就会轻松很多。“我“总是会不经意的出现的，也许不明显但是要能找到这个，然后就去掉。 睡棒棒精油 这个精油是一个北京中医药大学的同学做的东西，全名叫“梦香“精油。然后可以在公众号“三宝堂“里进一步了解，这个公众号也会有一些关于中医知识的推送。然后我写的一些东西就有从这里借鉴的","categories":[{"name":"一点技巧","slug":"Tips","permalink":"https://benderay.github.io/categories/Tips/"}],"tags":[{"name":"一点技巧","slug":"Tips","permalink":"https://benderay.github.io/tags/Tips/"}]},{"title":"英语学习","slug":"英语学习","date":"2018-04-09T14:10:39.000Z","updated":"2019-01-11T03:18:55.162Z","comments":true,"path":"2018/04/09/英语学习/","link":"","permalink":"https://benderay.github.io/2018/04/09/英语学习/","excerpt":"","text":"写一篇关于学习英语的博文，主要也是根据博主现阶段的初级水平来写的。然后很多都是博主从四处搜集来的一些资料和对学习资料的使用心得。 学习是一件动脑子越多越好的事情。在学习之前，了解自己掌握的程度也是十分重要的。对于喜欢自学的人来说，对自己因材施教就是比跟着老师学习要更加重要。 我有如下总结： 词汇量是初学者的第一道门槛，在掌握常用的7000～8000词以后的学习就会容易的很多。例如Ecnommist，BBC NEWS什么的就可以随意一些学习了。具体判断自己词汇量的方法提供一个网站 http://www.testyourvocab.com 最好用电脑做这个测试可以用tab键快速选择答案。在做完之后可以填一个网站的问卷调查，之后还可以看到网站对于问卷信息的收集汇总情况。博主看了以后立马有了迫切学好英语的动力！ 还有一个要点就是我们这里强调的掌握的常用单词数量在7k～8k，什么是常用单词呢？我就去搜索了一下，发现有一个COCA常用7000高频单词表。COCA是美国当代英语语料库(Corputs of Contemporary American English)的简写，简而言之就是一个搜集了众多英语资料（你能想到的报纸文献等等…）地址是 https://corputs.byu.edu/coca/ 然后这个语料库提供对词频的分析，和不同语境下语意的用法搭配等等。然后这个是免费的，于是我们就可以去里面把它的词频排序单词表下载下来，于是把前7k的词刷一遍就可以掌握特别大部分的常用英语单词了。 然后就开始刷单词了，开始刷的时候不一定要把每个单词所有意思都知道，知道差不多就行。所以要想先差不多，有个不错的方法就是用手机或者电脑一条一条的把不认识的单词往Excel里或者Onenote里输，定一些计划定期刷多少单词量。这个过程就相当于把你要记住的词库变成好多小份的单词表，然后定期去记忆。以及注意一下记忆中的温故知新，就是什么艾宾浩斯遗忘曲线，什么在三个不同场景下遇见这个单词就不会忘记。 然后博主推荐一下欧陆词典，这个词典有很好的扩展能力，可以安装装进任何词典，只要你有相关文件。具体添加外部词典的方法在软件中有提及，就是去相应的论坛下载好的词典就好。我在用的是牛津高阶词典第七版，这个是高中英语老师Lisa王告诉我们的，对她真的叫Lisa王，哈哈和她的中文名很取巧。 然后我还有收集到的一些好的资料是一本书《Word Power Made Easy》，我看了前几十页，因为还是有一定难度的。这本书给我的感觉就像是打开了一扇 native speaker 日常世界的大门。书中有一句话我粗浅的复述一下意思。 掌握更多词汇本身就是一种智慧 就像看过一本书叫《逻辑十九讲》不过没有看完，看了前多半部分。逻辑的基础就是要先知道A是什么，才能推出A的未来这样的。那么我们就要判断A有什么特征，与什么相同，与什么不同这样才算是比较完全的认识A了。那么如此看来掌握众多词汇的人就是可以比别人分辨更多的东西，就有了之后逻辑延伸的能力与能力的支撑了。","categories":[{"name":"学习","slug":"Study","permalink":"https://benderay.github.io/categories/Study/"}],"tags":[{"name":"学习","slug":"Study","permalink":"https://benderay.github.io/tags/Study/"}]},{"title":"随笔2018年4月8日","slug":"随笔2018年4月8日","date":"2018-04-08T12:55:51.000Z","updated":"2019-01-11T03:24:35.683Z","comments":true,"path":"2018/04/08/随笔2018年4月8日/","link":"","permalink":"https://benderay.github.io/2018/04/08/随笔2018年4月8日/","excerpt":"","text":"在一次大学的一次夏令营中，我认识了一个喜欢周游世界的学长，而且他确实也是周游世界了，特别会玩。但是聊的多了，我对他的一句话印象特别深刻。 “我从小到大去不同的城市读书，每去一个地方都会和上一个地方的同学失去所有联系” 说实在我也算是到目前为止换了三个地方学习了，但是我似乎从来没有去想过在离开的时候和曾经的同学朋友该怎么继续，但是似乎所有该继续的都在我不经意之间往前走了。有一句话说时间只是悄悄的改变一切。我现在发现当我真正才开始去注意时间的改变的时候，我已经止步不前被时间抛到了后面了。 我尝试用消息去和之前的人建立联系，但是我能传达的信息终究是少而片面的。我不切实际的想，如果我们之间不能用语言文字交流，像原始人一样，反而那人的眼神、动作、面部表情才是分别之后留在我们记忆中的东西。但是我们又不是原始人，技术在一直发展，信息更丰富的传播更能调动感情的交流。能打电话就不要发微信了，有空视频就不要打电话了，可以见面还是一定要见面才好。 所以重要的人一定要见面才好","categories":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/categories/inadvertently/"}],"tags":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/tags/inadvertently/"}]},{"title":"聊一聊开通博客","slug":"聊一聊博客开通","date":"2018-04-08T09:39:23.000Z","updated":"2019-01-11T03:25:12.852Z","comments":true,"path":"2018/04/08/聊一聊博客开通/","link":"","permalink":"https://benderay.github.io/2018/04/08/聊一聊博客开通/","excerpt":"","text":"今天也算是费了些力气把博客搭了一下，一直没有固定的一个博客去写一写平时突然冒出来的感悟到的一些想法。博主是一个语文成绩飘忽不定的人，高考能把语文苟到及格线也是不容易的一件事。可能班里一些同学比较要强吧，总说自己当年语文全班除了弃考的同学倒数第一，嗯…我还是相信自己当年是认真比对过全班的各科成绩的，那就闷声发大财喽。如此来看博主的文笔还是一般的，只是写一些平时的想法，如果有想和我探讨的呢…就不要探讨了，我确实肚子里墨不很多，读的书也少。一句话，就是闲了的时候写写东西锻炼一下自己，望各位见谅。不过世界这么大，也许我们只是偶遇而已，就不要和我纠结了。所以，博客里也就不留联系方式了。 也想把对初中语文老师的感谢写在博客的第一篇文章里。初中的语文老师对我们要求比较严格，曾经要求我们每天都要写400字左右的日记。当时每天写日记的感觉是十分痛苦，但是写着写着，人就对身边的事情开始仔细观察了起来。同时又有通过日记频繁大量的表达，总之现在写日记对我来说是一件开心的事情。当然更锦上添花的是可以在ThinkPad上没得说的键盘敲日记，就很丝滑。","categories":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/categories/inadvertently/"}],"tags":[{"name":"随便什么","slug":"inadvertently","permalink":"https://benderay.github.io/tags/inadvertently/"}]}]}